pnt325/EFR32BG22-Thunerboard-ICM20648-DMP-QUATER_6/base_project_thunderboard_mcu/gecko_sdk_4.1.1/hardware/driver/icm20648/inc/sl_icm20648.h
#define ICM20648_REG_I2C_SLV1_ADDR       (ICM20648_BANK_3 | 0x07)    /**< I2C Slave1 Physical Address register                */
#define ICM20648_REG_I2C_SLV1_REG        (ICM20648_BANK_3 | 0x08)    /**< I2C Slave1 Register Address register                */
#define ICM20648_REG_I2C_SLV1_CTRL       (ICM20648_BANK_3 | 0x09)    /**< I2C Slave1 Control register                         */
#define ICM20648_REG_I2C_SLV1_DO         (ICM20648_BANK_3 | 0x0A)    /**< I2C Slave1 Data Out register                        */

#define ICM20648_REG_I2C_SLV2_ADDR       (ICM20648_BANK_3 | 0x0B)    /**< I2C Slave2 Physical Address register                */
#define ICM20648_REG_I2C_SLV2_REG        (ICM20648_BANK_3 | 0x0C)    /**< I2C Slave2 Register Address register                */
#define ICM20648_REG_I2C_SLV2_CTRL       (ICM20648_BANK_3 | 0x0D)    /**< I2C Slave2 Control register                         */
#define ICM20648_REG_I2C_SLV2_DO         (ICM20648_BANK_3 | 0x0E)    /**< I2C Slave2 Data Out register                        */

#define ICM20648_REG_I2C_SLV3_ADDR       (ICM20648_BANK_3 | 0x0F)    /**< I2C Slave3 Physical Address register                */
#define ICM20648_REG_I2C_SLV3_REG        (ICM20648_BANK_3 | 0x10)    /**< I2C Slave3 Register Address register                */
#define ICM20648_REG_I2C_SLV3_CTRL       (ICM20648_BANK_3 | 0x11)    /**< I2C Slave3 Control register                         */
#define ICM20648_REG_I2C_SLV3_DO         (ICM20648_BANK_3 | 0x12)    /**< I2C Slave3 Data Out register                        */

#define ICM20648_REG_I2C_SLV4_ADDR       (ICM20648_BANK_3 | 0x13)    /**< I2C Slave4 Physical Address register                */
#define ICM20648_REG_I2C_SLV4_REG        (ICM20648_BANK_3 | 0x14)    /**< I2C Slave4 Register Address register                */
#define ICM20648_REG_I2C_SLV4_CTRL       (ICM20648_BANK_3 | 0x15)    /**< I2C Slave4 Control register                         */
#define ICM20648_REG_I2C_SLV4_DO         (ICM20648_BANK_3 | 0x16)    /**< I2C Slave4 Data Out register                        */
#define ICM20648_REG_I2C_SLV4_DI         (ICM20648_BANK_3 | 0x17)    /**< I2C Slave4 Data In register                         */

#define ICM20648_BIT_I2C_SLV_EN          0x80                        /**< I2C Slave Enable bit                                */
#define ICM20648_BIT_I2C_BYTE_SW         0x40                        /**< I2C Slave Byte Swap enable bit                      */
#define ICM20648_BIT_I2C_REG_DIS         0x20                        /**< I2C Slave Do Not Write Register Value bit           */
#define ICM20648_BIT_I2C_GRP             0x10                        /**< I2C Slave Group bit                                 */
#define ICM20648_BIT_I2C_READ            0x80                        /**< I2C Slave R/W bit                                   */

/* Register common for all banks */
#define ICM20648_REG_BANK_SEL            0x7F                        /**< Bank Select register                                */

#define ICM20648_DEVICE_ID               0xE0                        /**< ICM20648 Device ID value                            */
#define ICM20948_DEVICE_ID               0xEA                        /**< ICM20948 Device ID value                            */
/**@}*/
/**@}*/ //icm20648_details
/***************************************************************************//**
 * @brief
 *    Initialize the SPI bus to communicate with the ICM20648.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_spi_init(void);

/***************************************************************************//**
 * @brief
 *    Read register from the ICM20648 device.
 *
 * @param[in] addr
 *    The register address to read from in the sensor
 *    Bit[8:7] - bank address
 *    Bit[6:0] - register address
 *
 * @param[in] numBytes
 *    The number of bytes to read
 *
 * @param[out] data
 *    The data read from the register
 ******************************************************************************/
void sl_icm20648_read_register(uint16_t addr, int numBytes, uint8_t *data);

/***************************************************************************//**
 * @brief
 *    Write a register in the ICM20648 device.
 *
 * @param[in] addr
 *    The register address to write
 *    Bit[8:7] - bank address
 *    Bit[6:0] - register address
 *
 * @param[in] data
 *    The data to write to the register
 ******************************************************************************/
void sl_icm20648_write_register(uint16_t addr, uint8_t data);
void sl_icm20648_chip_select_set(bool select);

/***************************************************************************//**
 * @brief
 *    Select the desired register bank.
 *
 * @param[in] bank
 *    The address of the register bank (0..3)
 ******************************************************************************/
void sl_icm20648_select_register_bank(uint8_t bank);

/***************************************************************************//**
 * @brief
 *    Perform soft reset on the ICM20648 chip.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_reset(void);

/***************************************************************************//**
 * @brief
 *    Set the sample rate both of the accelerometer and the gyroscope.
 *
 * @param[in] sampleRate
 *    The desired sample rate in Hz. Because the resolution of the sample rate
 *    divider is different in the accel and gyro stages, two sensors
 *    may have a different sample rate set.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_set_sample_rate(float sampleRate);

/***************************************************************************//**
 * @brief
 *    Set the sample rate of the accelerometer.
 *
 * @param[in] sampleRate
 *    The desired sample rate in Hz
 *
 * @return
 *    The actual sample rate, which may be different than the desired value because
 *    of the finite and discrete number of divider settings.
 ******************************************************************************/
float sl_icm20648_gyro_set_sample_rate(float sampleRate);

/***************************************************************************//**
 * @brief
 *    Set the sample rate of the gyroscope.
 *
 * @param[in] sampleRate
 *    The desired sample rate in Hz
 *
 * @return
 *    The actual sample rate, which may be different than the desired value because
 *    of the finite and discrete number of divider settings.
 ******************************************************************************/
float sl_icm20648_accel_set_sample_rate(float sampleRate);

/***************************************************************************//**
 * @brief
 *    Set the bandwidth of the gyroscope.
 *
 * @param[in] gyroBw
 *    The desired bandwidth value. Use the ICM20648_GYRO_BW_xHZ macros, which
 *    are defined in the icm20648.h file. The value of x can be
 *    6, 12, 24, 51, 120, 150, 200, 360 or 12100.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_gyro_set_bandwidth(uint8_t gyroBw);

/***************************************************************************//**
 * @brief
 *    Set the bandwidth of the accelerometer.
 *
 * @param[in] accelBw
 *    The desired bandwidth value. Use the ICM20648_ACCEL_BW_yHZ macros, which
 *    are defined in the icm20648.h file. The value of y can be
 *    6, 12, 24, 50, 111, 246, 470 or 1210.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_accel_set_bandwidth(uint8_t accelBw);

/***************************************************************************//**
 * @brief
 *    Read the raw acceleration value and convert to g value based on
 *    the actual resolution.
 *
 * @param[out] accel
 *    A 3-element array of float numbers containing the acceleration values
 *    for the x, y and z axes in g units.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_accel_read_data(float *accel);

/***************************************************************************//**
 * @brief
 *    Read the raw gyroscope value and convert to deg/sec value based on
 *    the actual resolution.
 *
 * @param[out] gyro
 *    A 3-element array of float numbers containing the gyroscope values
 *    for the x, y and z axes in deg/sec units.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_gyro_read_data(float *gyro);

/***************************************************************************//**
 * @brief
 *    Get the actual resolution of the accelerometer.
 *
 * @param[out] accelRes
 *    The resolution in g/bit units
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_accel_get_resolution(float *accelRes);

/***************************************************************************//**
 * @brief
 *    Get the actual resolution of the gyroscope.
 *
 * @param[out] gyroRes
 *    The actual resolution in (deg/sec)/bit units
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_gyro_get_resolution(float *gyroRes);

/***************************************************************************//**
 * @brief
 *    Set the full scale value of the accelerometer.
 *
 * @param[in] accelFs
 *    The desired full scale value. Use the ICM20648_ACCEL_FULLSCALE_xG
 *    macros, which are defined in the icm20648.h file. The value of x can be
 *    2, 4, 8 or 16.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_accel_set_full_scale(uint8_t accelFs);

/***************************************************************************//**
 * @brief
 *    Set the full scale value of the gyroscope.
 *
 * @param[in] gyroFs
 *    The desired full scale value. Use the ICM20648_GYRO_FULLSCALE_yDPS
 *    macros, which are defined in the icm20648.h file. The value of y can be
 *    250, 500, 1000 or 2000.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_gyro_set_full_scale(uint8_t gyroFs);

/***************************************************************************//**
 * @brief
 *    Enable or disable the sleep mode of the device.
 *
 * @param[in] enable
 *    If true, sleep mode is enabled. Set to false to disable sleep mode.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_enable_sleep_mode(bool enable);

/***************************************************************************//**
 * @brief
 *    Enable or disable the cycle mode operation of the accel and gyro.
 *
 * @param[in] enable
 *    If true both the accel and gyro sensors will operate in cycle mode. If
 *    false the senors working in continuous mode.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_enable_cycle_mode(bool enable);

/***************************************************************************//**
 * @brief
 *    Enable or disable the sensors in the ICM20648 chip.
 *
 * @param[in] accel
 *    If true, enables the acceleration sensor
 *
 * @param[in] gyro
 *    If true, enables the gyroscope sensor
 *
 * @param[in] temp
 *    If true, enables the temperature sensor
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_enable_sensor(bool accel, bool gyro, bool temp);

/***************************************************************************//**
 * @brief
 *    Enable or disable sensors in low-power mode in the ICM20648 chip.
 *
 * @param[in] enAccel
 *    If true, enables the acceleration sensor in low power mode
 *
 * @param[in] enGyro
 *    If true, enables the gyroscope sensor in low power mode
 *
 * @param[in] enTemp
 *    If true, enables the temperature sensor in low power mode
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_enter_low_power_mode(bool enAccel, bool enGyro, bool enTemp);

/***************************************************************************//**
 * @brief
 *    Enable or disable the interrupts in the ICM20648 chip.
 *
 * @param[in] dataReadyEnable
 *    If true, enables the Raw Data Ready interrupt, otherwise disables.
 *
 * @param[in] womEnable
 *    If true, enables the Wake-up On Motion interrupt, otherwise disables.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_enable_interrupt(bool dataReadyEnable, bool womEnable);

/***************************************************************************//**
 * @brief
 *    Read the interrupt status registers of the ICM20648 chip.
 *
 * @param[out] int_status
 *    The content the four interrupt registers. LSByte is INT_STATUS, MSByte is
 *    INT_STATUS_3
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_read_interrupt_status(uint32_t *int_status);

/***************************************************************************//**
 * @brief
 *    Check if new data is available to read.
 *
 * @return
 *    Returns true if the Raw Data Ready interrupt bit set, false otherwise
 ******************************************************************************/
bool sl_icm20648_is_data_ready(void);

/***************************************************************************//**
 * @brief
 *    Set up and enable the Wake-up On Motion feature.
 *
 * @param[in] enable
 *    If true enables the WOM feature, disables otherwise
 *
 * @param[in] womThreshold
 *    Threshold value for the Wake on Motion Interrupt for ACCEL x/y/z axes.
 *    LSB = 4mg. Range is 0mg to 1020mg
 *
 * @param[in] sampleRate
 *    The desired sample rate of the accel sensor in Hz
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_enable_wake_on_motion_interrupt(bool enable, uint8_t womThreshold, float sampleRate);

/***************************************************************************//**
 * @brief
 *    Initialize the ICM20648 sensor. Enable the power supply and SPI lines,
 *    set up the host SPI controller, configure the chip control interface,
 *    clock generator, and interrupt line.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_init(void);

/***************************************************************************//**
 * @brief
 *    De-initialize the ICM20648 sensor by disconnecting the supply and SPI
 *    lines.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_deinit(void);

/***************************************************************************//**
 * @brief
 *    Accelerometer and gyroscope calibration function. Reads the gyroscope
 *    and accelerometer values while the device is at rest and in level. The
 *    resulting values are loaded to the accel and gyro bias registers to cancel
 *    the static offset error.
 *
 * @param[out] accelBiasScaled
 *    The mesured acceleration sensor bias in mg
 *
 * @param[out] gyroBiasScaled
 *    The mesured gyro sensor bias in deg/sec
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_calibrate_accel_and_gyro(float *accelBiasScaled, float *gyroBiasScaled);

/***************************************************************************//**
 * @brief
 *    Gyroscope calibration function. Read the gyroscope
 *    values while the device is at rest and in level. The
 *    resulting values are loaded to the gyro bias registers to cancel
 *    the static offset error.
 *
 * @param[out] gyroBiasScaled
 *    The mesured gyro sensor bias in deg/sec
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_calibrate_gyro(float *gyroBiasScaled);

/***************************************************************************//**
 * @brief
 *    Read the temperature sensor raw value and convert to Celsius.
 *
 * @param[out] temperature
 *    The mesured temperature in Celsius
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_read_temperature_data(float *temperature);

/***************************************************************************//**
 * @brief
 *    Read the device ID of the ICM20648.
 *
 * @param[out] devID
 *    The ID of the device read from the WHO_AM_I register. Expected value 0xE0.
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
sl_status_t sl_icm20648_get_device_id(uint8_t *devID);

/** @} */

#ifdef __cplusplus
}
#endif

#endif // SL_ICM20648_H
